## Importar pandas

In [2]:
import pandas as pd

## Ler DataFrame de arquivo CSV

In [3]:
data = pd.read_csv('titanic/train.csv')

## Primeiras Linhas

In [4]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Últimas Linhas

In [5]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## Informações do DataFrame

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Resumo Estatístico de Campos Numéricos

In [7]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

## Resumo estatístico de campos Categóricos

In [47]:
data.describe(include = 'O')

                       Nome Bilhete Titulo
count                   891     891    891
unique                  891     365     17
top     Dooley, Mr. Patrick   34708     Mr
freq                      1      20    517

## Renomear colunas

In [9]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
data.rename({'Name': 'Nome', 'Sex' : 'Sexo'}, axis=1, inplace= True)

In [11]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Nome', 'Sexo', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
data.columns = ['idPassagero', 'Sobreviventes', 'Classe', 'Nome', 'Sexo', 'Idade',
                'IrmaosConjudge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']

In [13]:
data.head(2)

,idPassagero,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosConjudge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [14]:
data.columns

Index(['idPassagero', 'Sobreviventes', 'Classe', 'Nome', 'Sexo', 'Idade',
       'IrmaosConjudge', 'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine',
       'Embarque'],
      dtype='object')

# Selecionar Colunas Específicas

In [15]:
data[['Nome', 'Sexo' , 'Sobreviventes']].head()

                                                Nome    Sexo  Sobreviventes
0                            Braund, Mr. Owen Harris    male              0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female              1
2                             Heikkinen, Miss. Laina  female              1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female              1
4                           Allen, Mr. William Henry    male              0

## Selecionando apenas uma coluna - Data Series

In [16]:
data['Sexo']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sexo, Length: 891, dtype: object

## Funções matemáticas embutidas

In [17]:
data.Idade.min()

0.42

In [18]:
data.iloc[803]

idPassagero                                   804
Sobreviventes                                   1
Classe                                          3
Nome              Thomas, Master. Assad Alexander
Sexo                                         male
Idade                                        0.42
IrmaosConjudge                                  0
PaisFilhos                                      1
Bilhete                                      2625
Tarifa                                     8.5167
Cabine                                        NaN
Embarque                                        C
Name: 803, dtype: object

In [19]:

data['Idade'].iloc[2:10]

2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Idade, dtype: float64

## Selecionando pelo Index - iloc

In [20]:
 resultado = data[['Idade','Sexo','Tarifa','Sobreviventes']]\
.loc[(data['Idade']==14)  & (data.Sobreviventes ==1)&(data.Sexo=='female')]
numericas = resultado.select_dtypes(include='number')
numericas.count()

Idade            3
Tarifa           3
Sobreviventes    3
dtype: int64

## Operador de seleção "loc"

## Selecionando com múltiplas condições

## map e replace

## Groupby - Agrupar por

In [21]:


data.groupby('Sobreviventes').count()

,idPassagero,Classe,Nome,Sexo,Idade,IrmaosConjudge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
Sobreviventes,,,,,,,,,,,
0,549,549,549,549,424,549,549,549,549,68,549
1,342,342,342,342,290,342,342,342,342,136,340

In [22]:
data.groupby('Sobreviventes').mean(numeric_only=True)

,idPassagero,Classe,Idade,IrmaosConjudge,PaisFilhos,Tarifa
Sobreviventes,,,,,,
0,447.016393,2.531876,30.626179,0.553734,0.329690,22.117887
1,444.368421,1.950292,28.343690,0.473684,0.464912,48.395408

In [23]:
data.groupby(['Sexo', 'Classe']).mean(numeric_only=True)

               idPassagero  Sobreviventes      Idade  IrmaosConjudge  \
Sexo   Classe
female 1        469.212766       0.968085  34.611765        0.553191
       2        443.105263       0.921053  28.722973        0.486842
       3        399.729167       0.500000  21.750000        0.895833
male   1        455.729508       0.368852  41.281386        0.311475
       2        447.962963       0.157407  30.740707        0.342593
       3        455.515850       0.135447  26.507589        0.498559

               PaisFilhos      Tarifa
Sexo   Classe
female 1         0.457447  106.125798
       2         0.605263   21.970121
       3         0.798611   16.118810
male   1         0.278689   67.226127
       2         0.222222   19.741782
       3         0.224784   12.661633

## Crosstab

In [24]:
pd.crosstab(data['Sexo'], data['Classe'], margins = True).style.background_gradient(cmap ='Blues')

## Ordenando Dados

In [25]:
data.sort_values('Idade', ascending=False)

,idPassagero,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosConjudge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

## Lidando com dados faltando $\rightarrow$ NaN - Not a Number

In [26]:

data.isnull()

,idPassagero,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosConjudge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [27]:
data.loc[data['Embarque'].isnull()]

,idPassagero,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosConjudge,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [28]:
data['Embarque'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [29]:
data['Embarque'].mode()

0    S
Name: Embarque, dtype: object

In [50]:
data.describe(include ='O')

                       Nome Bilhete Titulo
count                   891     891    891
unique                  891     365     17
top     Dooley, Mr. Patrick   34708     Mr
freq                      1      20    517

In [49]:
data['Embarque'].fillna('Q', inplace = True)

KeyError: 'Embarque'

In [32]:
data['Embarque'].at[829] = 'S'

## Deletando Coluna ou Linha

In [33]:
data.isnull().sum()

idPassagero         0
Sobreviventes       0
Classe              0
Nome                0
Sexo                0
Idade             177
IrmaosConjudge      0
PaisFilhos          0
Bilhete             0
Tarifa              0
Cabine            687
Embarque            0
dtype: int64

In [34]:
data.drop('Cabine', axis=1, inplace = True)

## Apply e Lambda

In [35]:
data['Bilhete'] = data['Bilhete'].apply(lambda x :x[:-1])

In [51]:
data['Bilhete']

0             A/5 2117
1              PC 1759
2      STON/O2. 310128
3                11380
4                37345
            ...
886              21153
887              11205
888          W./C. 660
889              11136
890              37037
Name: Bilhete, Length: 891, dtype: object

## Variáveis Dummy | HotEncoder

In [37]:
data = pd.get_dummies(data,columns =['Sexo'],drop_first = True)

In [38]:
embarque =pd.get_dummies(data['Embarque'], drop_first = True)

In [39]:
embarque

         Q      S
0    False   True
1    False  False
2    False   True
3    False   True
4    False   True
..     ...    ...
886  False   True
887  False   True
888  False   True
889  False  False
890   True  False

[891 rows x 2 columns]

## Concatenando DataFrames

In [40]:
data = pd.concat([data,embarque],axis=1)

In [41]:
data.shape

(891, 13)

In [42]:
data.drop(['Q','S'], axis=1, inplace= True)

In [43]:
data.drop('Embarque', axis=1, inplace= True)

# Expressões Regulares

.  - qualquer caracter
<br>\d - dígitos (0-9)
<br>\D - exceto dígitos (0-9)
<br>\w - palavra (a-z, A-Z, 0-9, \_)
<br>\s - espaço em branco (tab, espaço, nova linha)
<br>\S - qualquer coisa exceto espaço em branco (tab, espaço, nova linha)
<br>\b - início de uma palavra
<br>\B - exceto início da palavra
<br>^ - inicio de uma String
<br>$ - final de uma string
<br>[] - caracteres em colchetes
<br>[^] - caracteres não em colchetes
<br>| - ou
<br>( ) - grupo

<br>* - nenhum ou mais
<br>+ - um ou mais
<br>? - nenhum ou um
<br>{3} - número exato
<br>{3,4} - range de Números (mínimo, máximo)

Referência (inglês): 
http://bit.ly/ExpressoesRegulares

In [44]:
 data['Titulo']=data.Nome.str.extract('([a-zA-Z]+)\.')

In [55]:
pd.crosstab(data['Titulo'],data['Sexo'])

KeyError: 'SexoMasc'

# Engenharia de Recursos - Feature Engineering

In [ ]:
data.rename(columns={'Sexo_male': 'SexoMasc'}, inplace=True)

In [ ]:
data['Sexo']= data['SexoMasc'].map({True: 'homem', False: 'mulher'})

In [ ]:
data['Sexo']

In [ ]:
data[['Titulo','Sexo','Idade','Sobreviventes']].loc[data['Titulo']=='Miss']

In [ ]:
data.Titulo = data['Titulo'].apply(lambda x : 'Outros' if x not in ['Master', 'Miss', 'Mr', 'Mrs'] else x)

## Mudando Valores Linha Por Linha - iterrows()

In [56]:
cabine = pd.read_csv('titanic/train.csv')

In [57]:
cabine.Cabin.head()

0     NaN
1     C85
2     NaN
3    C123
4     NaN
Name: Cabin, dtype: object

In [58]:
cabine = cabine.dropna(subset=['Cabin'])

In [59]:
cabine.Cabin

1              C85
3             C123
6              E46
10              G6
11            C103
          ...
871            D35
872    B51 B53 B55
879            C50
887            B42
889           C148
Name: Cabin, Length: 204, dtype: object

In [60]:
cabine.shape

(204, 12)

In [64]:

for idx, _ in cabine[['Cabin']].dropna().iterrows():
    cabine_individual = cabine['Cabin'].at[idx]
    cabine['Cabin'].at[idx] = cabine_individual[0]

In [76]:
cabine[['Cabin','Survived','Pclass']].groupby('Cabin',).count()

       Survived  Pclass
Cabin
A            15      15
B            47      47
C            59      59
D            33      33
E            32      32
F            13      13
G             4       4
T             1       1